{
  "experience": [
    {
      "company": "London Metropolitan University",
      "location": "London, UK",
      "title": "MSc in Artificial Intelligence",
      "dates": "09/2024 - 10/2025",
      "startDate": "2024-09",
      "endDate": "2025-10",
      "type": "education",
      "description": "Completed MSc in Artificial Intelligence with A Grade (Distinction), specializing in Machine Learning, Deep Learning, Computer Vision, and NLP. Developed advanced AI solutions using Python, TensorFlow, PyTorch, and Scikit-learn. Research project focused on Deepfake Detection using a CNN + Multi-Head Self-Attention hybrid architecture, achieving improved detection accuracy across multiple datasets. Key modules included AI Vision & Deep Learning, Advanced AI Technologies, Machine Learning, Cloud Computing & IoT, and Data Warehousing & Big Data.",
      "featured": true,
      "highlights": [
        "Achieved A Grade (Distinction) in rigorous AI program",
        "Developed Deepfake Detection system using hybrid CNN-MHSA architecture",
        "Hands-on experience with CNNs, RNNs, Transformers, and attention mechanisms",
        "Applied model optimization and quantization techniques for production deployment",
        "Member of AI & Data Science Society, participating in hackathons and research seminars"
      ]
    },
    {
      "company": "LN Webworks Private Limited",
      "location": "Ludhiana, Punjab, India",
      "title": "Software Developer (Drupal Developer)",
      "dates": "08/2021 - 04/2024",
      "startDate": "2021-08",
      "endDate": "2024-04",
      "type": "work",
      "description": "Built and delivered scalable, high-performance Drupal and headless web applications across diverse client projects spanning property investment platforms, educational institutions, laboratory management systems, and e-commerce solutions. Led full development lifecycle from architecture and custom module development to deployment, performance optimization, and maintenance. Specialized in Headless/Decoupled Drupal with React, REST API integrations, and database optimization, consistently improving site performance and reducing deployment time through automation and server management.",
      "featured": true,
      "highlights": [
        "Developed custom Drupal modules enabling dynamic, secure website architectures",
        "Implemented Headless Drupal with React for enhanced UX and flexible front-end delivery",
        "Integrated REST APIs and JSON data flows for multi-system communication",
        "Optimized database queries, caching layers, and asset pipelines for improved performance",
        "Created automation scripts for multisite deployment reducing deployment time significantly",
        "Managed Linux server environments and troubleshot production issues",
        "Built property investment platform, university site with complex student profile management, laboratory ticketing system, and e-commerce solutions"
      ]
    },
    {
      "company": "I. K. Gujral Punjab Technical University",
      "location": "Punjab, India",
      "title": "Bachelor of Computer Applications",
      "dates": "07/2017 - 11/2020",
      "startDate": "2017-07",
      "endDate": "2020-11",
      "type": "education",
      "description": "Completed Bachelor of Computer Applications (Second Class), developing strong foundation in computer science fundamentals, programming, software development, algorithms, databases, and system architecture. Gained hands-on experience with multiple programming languages including C, C++, Python, PHP, and Java. Coursework included Data Structures, Database Management Systems, Object-Oriented Programming, Web Development, and Computer System Architecture.",
      "featured": true,
      "highlights": [
        "Solid foundation in computer science fundamentals and programming",
        "Proficiency in C, C++, Python, PHP, Java, and web technologies",
        "Strong understanding of data structures, algorithms, and database systems",
        "Experience with web development and software engineering principles"
      ]
    }
  ]
}
